GridSecureConnectionManager/test/resources/soapMessages/testSOAP_Secure.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soapenv:Header><wsa:MessageID soapenv:mustUnderstand="0">uuid:07adf790-dc57-11dd-8288-edcb02dd1be9</wsa:MessageID><wsa:To soapenv:mustUnderstand="0">http://localhost:99/wsrf/services/cagrid/LexEVSGridService</wsa:To><wsa:Action soapenv:mustUnderstand="0">http://LexBIGCaGridServices.cagrid.LexBIG.LexGrid.org/LexBIGCaGridServices/ResolveCodingSchemeRequest</wsa:Action><wsa:From soapenv:mustUnderstand="0"><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:From><ns1:SecureDLBConnectionKey xmlns:ns1="http://LexBIGCaGridServices.cagrid.LexBIG.LexGrid.org/LexBIGCaGridServices" soapenv:mustUnderstand="0">@@CONNECTION_KEY@@</ns1:SecureDLBConnectionKey></soapenv:Header><soapenv:Body><ResolveCodingSchemeRequest xmlns="http://LexBIGCaGridServices.cagrid.LexBIG.LexGrid.org/LexBIGCaGridServices"><codingSchemeIdentification><ns1:CodingSchemeIdentification xmlns:ns1="http://LexGrid.org/LexBIG/2008/01/caGrid"><ns1:name>http://www.co-ode.org/ontologies/pizza/pizza.owl#</ns1:name></ns1:CodingSchemeIdentification></codingSchemeIdentification><versionOrTag><ns2:CodingSchemeVersionOrTag xmlns:ns2="http://LexGrid.org/LexBIG/2008/01/Core"><ns2:version>version 1.5</ns2:version></ns2:CodingSchemeVersionOrTag></versionOrTag></ResolveCodingSchemeRequest></soapenv:Body></soapenv:Envelope>